---
kind: method
id: M:Autodesk.Revit.DB.Transaction.GetName
zh: 事务
source: html/efc9e55a-1457-db92-66ec-84fcfc688552.htm
---
# Autodesk.Revit.DB.Transaction.GetName Method

**中文**: 事务

Returns the transaction's name.

## Syntax (C#)
```csharp
public string GetName()
```

## Returns
The transaction's current name.